Router>en
Router#conf te
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hos
Router(config)#hostname R3
R3(config)#no ip domain-lo
R3(config)#no ip domain-lookup 
R3(config)#in
R3(config)#interface gi
R3(config)#interface gigabitEthernet 0/1
R3(config-if)#ip add
R3(config-if)#ip address 192.168.3.2 255.255.255.0
R3(config-if)#no sh
R3(config-if)#no shutdown 

R3(config-if)#ex
R3(config)#do wr
Building configuration...
[OK]
R3(config)#in
R3(config)#interface gi
R3(config)#interface gigabitEthernet 0/0
R3(config-if)#ip add
R3(config-if)#ip address 192.168.4.1 255.255.255.0
R3(config-if)#no sh
R3(config-if)#no shutdown 

R3(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up




R3>
R3>en
R3>enable 
R3#conf
R3#configure  te
Enter configuration commands, one per line.  End with CNTL/Z.

R3(config)#ip route 192.168.1.0 255.255.255.0 192.168.3.1
R3(config)#ip route 192.168.5.0 255.255.255.0 192.168.3.1
R3(config)#do wr
Building configuration...
[OK]

R3(config)#do sh ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

S    192.168.1.0/24 [1/0] via 192.168.3.1
     192.168.3.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.3.0/24 is directly connected, GigabitEthernet0/1
L       192.168.3.2/32 is directly connected, GigabitEthernet0/1
     192.168.4.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.4.0/24 is directly connected, GigabitEthernet0/0
L       192.168.4.1/32 is directly connected, GigabitEthernet0/0
S    192.168.5.0/24 [1/0] via 192.168.3.1
R3(config)#ip route 192.168.5.0 255.255.255.0 192.168.3.1
R3(config)#ip route 192.168.1.0 255.255.255.0 192.168.3.1
R3(config)#
R3(config)#ping 192.168.1.1
            ^
% Invalid input detected at '^' marker.
	
R3(config)#